Tekla Open API Reference for Tekla Structures 2025
DrawingItemEnumerator Methods
The DrawingItemEnumerator type exposes the following members.
Methods
Name | Description
GetSize
 Returns the total amout of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
See Also
Reference
DrawingItemEnumerator Class
Tekla.Structures.Catalogs Namespace